# Set up notebook

## Load libraries

In [1]:
import pandas as pd
import os

## Set up notebook

In [2]:
# To output more than one output from one cell without print()
from IPython.core.interactiveshell import InteractiveShell 
InteractiveShell.ast_node_interactivity = 'all'

# Set up formatting so larger numbers aren't displayed in scientific notation (h/t @thecapacity)
pd.set_option('display.float_format', lambda x: '%.3f' % x)

## Set up working directories

In [7]:
path_forDataIn = 'C:\\Users\\girtfolk\\Desktop\\Study\\DataCamp\\DataIn'
os.chdir(path_forDataIn)
os.getcwd()

'C:\\Users\\girtfolk\\Desktop\\Study\\DataCamp\\DataIn'

# GENERAL FINDINGS

In [ ]:
# Use pd.concat() over .append() as it gives more flexibility!!!

# Preparing data

## Reading multiple data files

### General

In [17]:
# Read_csv example
dataFrame0 = pd.read_csv('sales-jan-2015.csv')
dataFrame1 = pd.read_csv('sales-feb-2015.csv')

# Output
dataFrame0.head()
dataFrame1.head()

                  Date    Company   Product  Units
0  2015-01-21 19:13:21  Streeplex  Hardware     11
1  2015-01-09 05:23:51  Streeplex   Service      8
2  2015-01-06 17:19:34    Initech  Hardware     17
3  2015-01-02 09:51:06      Hooli  Hardware     16
4  2015-01-11 14:51:02      Hooli  Hardware     11

                  Date    Company   Product  Units
0  2015-02-26 08:57:45  Streeplex   Service      4
1  2015-02-16 12:09:19      Hooli  Software     10
2  2015-02-03 14:14:18    Initech  Software     13
3  2015-02-02 08:33:01      Hooli  Software      3
4  2015-02-25 00:29:00    Initech   Service     10

In [18]:
# Read 2 files in list of dataframes
fileNames = ['sales-jan-2015.csv', 'sales-feb-2015.csv']
dataFrames = []
for f in fileNames:
    dataFrames.append(pd.read_csv(f))

# Output    
type(dataFrames)

list

In [19]:
# Sames as above using list comprehension
fileNames = ['sales-jan-2015.csv', 'sales-feb-2015.csv']
dataFrames = [pd.read_csv(f) for f in fileNames]

# Output
len(dataFrames)

2

#### glob - regex usage in filenames

In [20]:
# If many fileNames have similar pattern, then regex could be exploited, to do it use - glob
from glob import glob

filenames = glob('sales*.csv')  # * - wildcard, matches 0 or more characters
dataframes = [pd.read_csv(f) for f in filenames]
#   Output
dataframes[1].head()

                  Date    Company   Product  Units
0  2015-01-21 19:13:21  Streeplex  Hardware     11
1  2015-01-09 05:23:51  Streeplex   Service      8
2  2015-01-06 17:19:34    Initech  Hardware     17
3  2015-01-02 09:51:06      Hooli  Hardware     16
4  2015-01-11 14:51:02      Hooli  Hardware     11

### Reading DataFrames from multiple files

In [21]:
# Read 'Bronze.csv' into a DataFrame: bronze
bronze = pd.read_csv('Bronze.csv')
# Read 'Silver.csv' into a DataFrame: silver
silver = pd.read_csv('Silver.csv')
# Read 'Gold.csv' into a DataFrame: gold
gold = pd.read_csv('Gold.csv')

# Print the first five rows of gold
print(gold.head())

   NOC         Country    Total
0  USA   United States 2088.000
1  URS    Soviet Union  838.000
2  GBR  United Kingdom  498.000
3  FRA          France  378.000
4  GER         Germany  407.000

### Reading DataFrames from multiple files in loop

In [22]:
# Create the list of file names: filenames
filenames = ['Gold.csv', 'Silver.csv', 'Bronze.csv']
# Create the list of three DataFrames: dataframes
dataframes = []
for filename in filenames:
    dataframes.append(pd.read_csv(filename))

# Print top 5 rows of 1st DataFrame in dataframes
print(dataframes[0].head())

   NOC         Country    Total
0  USA   United States 2088.000
1  URS    Soviet Union  838.000
2  GBR  United Kingdom  498.000
3  FRA          France  378.000
4  GER         Germany  407.000

### Combining DataFrames from multiple data files

In [23]:
# Make a copy of gold: medals
medals = gold.copy()
# Create list of new column labels: new_labels
new_labels = ['NOC', 'Country', 'Gold']
# Rename the columns of medals using new_labels
medals.columns = new_labels
# Add columns 'Silver' & 'Bronze' to medals
# In all 3 data sets rows matches (one country is exactly in same row nr in all 3 data frames)
medals['Silver'] = silver['Total']
medals['Bronze'] = bronze['Total']

# Print the head of medals
print(medals.head())

   NOC         Country     Gold   Silver   Bronze
0  USA   United States 2088.000 1195.000 1052.000
1  URS    Soviet Union  838.000  627.000  584.000
2  GBR  United Kingdom  498.000  591.000  505.000
3  FRA          France  378.000  461.000  475.000
4  GER         Germany  407.000  350.000  454.000

## Reindexing DataFrames

### General

In [27]:
# THERE WERE NO DATA FOR WORK SO RECREATED THIS DATA!!!!
df = pd.read_csv('pittsburgh2013.csv')
df = df[['Date', 'Mean TemperatureF', 'Max TemperatureF']]
df['Date'] = pd.to_datetime(df['Date'])
df = df.groupby(df['Date'].dt.quarter).agg(['max', 'mean'])
df = df.iloc[:, [1, 2]]
df.columns = ['Mean TemperatureF', 'Max TemperatureF']
df.index = ['Jan', 'Apr', 'Jul', 'Oct']
df.index.name = 'Month'
w_mean = df[['Mean TemperatureF']].sort_index()
w_max = df[['Max TemperatureF']]

# THIS SHOULD BE EXECUTED IF THERE WERE .csv FILES!
# Load data and add row index to DataFrame
# w_mean = pd.read_csv('quarterly_mean_temp.csv', index_col='Month')  #   'Month' - becomes row index
# w_max = pd.read_csv('quarterly_max_temp.csv', index_col='Month')

# Output
w_mean # Alphabetical order
w_max # Chronological order

       Mean TemperatureF
Month
Apr               61.956
Jan               32.133
Jul               68.935
Oct               43.435

       Max TemperatureF
Month
Jan                  68
Apr                  89
Jul                  91
Oct                  84

In [28]:
# Acessing indexes
w_mean.index
w_max.index
type(w_mean.index)

Index(['Apr', 'Jan', 'Jul', 'Oct'], dtype='object', name='Month')

Index(['Jan', 'Apr', 'Jul', 'Oct'], dtype='object', name='Month')

pandas.core.indexes.base.Index

In [29]:
# Using .reindex()
ordered = ['Jan', 'Apr', 'Jul', 'Oct']
w_mean2 = w_mean.reindex(ordered)

w_mean2

       Mean TemperatureF
Month
Jan               32.133
Apr               61.956
Jul               68.935
Oct               43.435

In [30]:
# Using .sort_index()
w_mean2.sort_index()

       Mean TemperatureF
Month
Apr               61.956
Jan               32.133
Jul               68.935
Oct               43.435

In [31]:
# Reindex from a DataFrame Index
w_mean.reindex(w_max.index)

       Mean TemperatureF
Month
Jan               32.133
Apr               61.956
Jul               68.935
Oct               43.435

In [33]:
# Reindexing with missing labels
w_mean3 = w_mean.reindex(['Jan', 'Apr', 'Dec']) 
    # There were no Dec in w_mean indexes so after reindexing there will be: index - Dec; value - Nan

w_mean3

       Mean TemperatureF
Month
Jan               32.133
Apr               61.956
Dec                  nan

In [35]:
# Use index to see where data overlaps
w_max.reindex(w_mean3.index)

# usage of .dropna() to drop rows where all values in row are Nan
w_max.reindex(w_mean3.index).dropna()

       Max TemperatureF
Month
Jan              68.000
Apr              89.000
Dec                 nan

       Max TemperatureF
Month
Jan              68.000
Apr              89.000

#### Order in indexes MATTERS

In [38]:
w_max.index
w_max.reindex(w_mean.index)
w_mean.index
w_mean.reindex(w_max.index)

Index(['Jan', 'Apr', 'Jul', 'Oct'], dtype='object', name='Month')

       Max TemperatureF
Month
Apr                  89
Jan                  68
Jul                  91
Oct                  84

Index(['Apr', 'Jan', 'Jul', 'Oct'], dtype='object', name='Month')

       Mean TemperatureF
Month
Jan               32.133
Apr               61.956
Jul               68.935
Oct               43.435

### Sorting DataFrame with the Index & columns

In [53]:
# THERE WERE NO DATA FOR WORK SO RECREATED THIS DATA!!!!
df = pd.read_csv('pittsburgh2013.csv')
df = df[['Date', 'Max TemperatureF']]
df['Date'] = pd.to_datetime(df['Date'])
df = df.groupby(df['Date'].dt.month).agg('max')
df.index = df['Date'].dt.strftime('%b')
df.index.name = 'Month'
df.drop('Date', axis=1, inplace=True)

weather1 = df.copy()

weather1
# THIS SHOULD BE EXECUTED IF THERE WERE .csv FILES!
# Read 'monthly_max_temp.csv' into a DataFrame: weather1
# weather1 = pd.read_csv('monthly_max_temp.csv', index_col='Month')

       Max TemperatureF
Month
Jan                  68
Feb                  60
Mar                  68
Apr                  84
May                  88
Jun                  89
Jul                  91
Aug                  86
Sep                  90
Oct                  84
Nov                  72
Dec                  68

In [52]:
# Read 'monthly_max_temp.csv' into a DataFrame: weather1
#weather1 = pd.read_csv('monthly_max_temp.csv', index_col='Month')
# Print the head of weather1
print(weather1.head())

# Sort the index of weather1 in alphabetical order: weather2
weather2 = weather1.sort_index()
# Print the head of weather2
print(weather2.head())

# Sort the index of weather1 in reverse alphabetical order: weather3
weather3 = weather1.sort_index(ascending=False)
# Print the head of weather3
print(weather3.head())

# Sort weather1 numerically using the values of 'Max TemperatureF': weather4
weather4 = weather1.sort_values('Max TemperatureF')
# Print the head of weather4
print(weather4.head())

       Max TemperatureF
Month
Jan                  68
Feb                  60
Mar                  68
Apr                  84
May                  88
       Max TemperatureF
Month
Apr                  84
Aug                  86
Dec                  68
Feb                  60
Jan                  68
       Max TemperatureF
Month
Sep                  90
Oct                  84
Nov                  72
May                  88
Mar                  68
       Max TemperatureF
Month
Feb                  60
Jan                  68
Mar                  68
Dec                  68
Nov                  72

### Reindexing DataFrame from a list

In [55]:
# ADDITIONAL
weather1 = w_mean
    # Will use w_mean df created earlier, it is exactly what is needed for this task
year = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']

In [56]:
# Reindex weather1 using the list year: weather2
weather2 = weather1.reindex(year)
# Print weather2
print(weather2)

# Reindex weather1 using the list year with forward-fill: weather3
weather3 = weather1.reindex(year).ffill()
# Print weather3
print(weather3)

       Mean TemperatureF
Month
Jan               32.133
Feb                  nan
Mar                  nan
Apr               61.956
May                  nan
Jun                  nan
Jul               68.935
Aug                  nan
Sep                  nan
Oct               43.435
Nov                  nan
Dec                  nan
       Mean TemperatureF
Month
Jan               32.133
Feb               32.133
Mar               32.133
Apr               61.956
May               61.956
Jun               61.956
Jul               68.935
Aug               68.935
Sep               68.935
Oct               43.435
Nov               43.435
Dec               43.435

### Rendexing using another DataFrame Index

In [57]:
# ADDITIONAL
names_1981 = pd.read_csv('names1981.csv', header=None, names=['name','gender','count'], index_col=(0,1))
names_1881 = pd.read_csv('names1881.csv', header=None, names=['name','gender','count'], index_col=(0,1))
    # names - new column names, index_col - columns 0, 1 - will be set as index

In [58]:
# Reindex names_1981 with index of names_1881: common_names
common_names = names_1981.reindex(names_1881.index)
# Print shape of common_names
print(common_names.shape)

# Drop rows with null counts: common_names
common_names = common_names.dropna()
# Print shape of new common_names
print(common_names.shape)

(1935, 1)
(1587, 1)

## Arithmetic with Series & DataFrames

### General - .divide(), .pct_change(), .add()

In [59]:
# Loading weather data
weather = pd.read_csv('pittsburgh2013.csv', index_col='Date', parse_dates=True)
weather.head()

weather.loc['2013-7-1':'2013-7-7', 'PrecipitationIn']

,Max TemperatureF,Mean TemperatureF,Min TemperatureF,Max Dew PointF,MeanDew PointF,Min DewpointF,Max Humidity,Mean Humidity,Min Humidity,Max Sea Level PressureIn,...,Max VisibilityMiles,Mean VisibilityMiles,Min VisibilityMiles,Max Wind SpeedMPH,Mean Wind SpeedMPH,Max Gust SpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
Date,,,,,,,,,,,,,,,,,,,,,
2013-01-01,32,28,21,30,27,16,100,89,77,30.100,...,10,6,2,10,8,nan,0.000,8,Snow,277
2013-01-02,25,21,17,14,12,10,77,67,55,30.270,...,10,10,10,14,5,nan,0.000,4,NaN,272
2013-01-03,32,24,16,19,15,9,77,67,56,30.250,...,10,10,10,17,8,26.000,0.000,3,NaN,229
2013-01-04,30,28,27,21,19,17,75,68,59,30.280,...,10,10,6,23,16,32.000,0.000,4,NaN,250
2013-01-05,34,30,25,23,20,16,75,68,61,30.420,...,10,10,10,16,10,23.000,0.210,5,NaN,221

Date
2013-07-01   0.180
2013-07-02   0.140
2013-07-03   0.000
2013-07-04   0.250
2013-07-05   0.020
2013-07-06   0.060
2013-07-07   0.100
Name: PrecipitationIn, dtype: float64

In [60]:
# Scalar multiplication - broadcasting
weather.loc['2013-07-01':'2013-07-07', 'PrecipitationIn'] * 2.54

Date
2013-07-01   0.457
2013-07-02   0.356
2013-07-03   0.000
2013-07-04   0.635
2013-07-05   0.051
2013-07-06   0.152
2013-07-07   0.254
Name: PrecipitationIn, dtype: float64

In [61]:
# Absolute temperature range
week1_range = weather.loc['2013-07-01':'2013-07-07', ['Min TemperatureF', 'Max TemperatureF']]

week1_range

            Min TemperatureF  Max TemperatureF
Date
2013-07-01                66                79
2013-07-02                66                84
2013-07-03                71                86
2013-07-04                70                86
2013-07-05                69                86
2013-07-06                70                89
2013-07-07                70                77

In [62]:
# Average temperature
week1_mean = weather.loc['2013-07-01':'2013-07-07', 'Mean TemperatureF']

week1_mean

Date
2013-07-01    72
2013-07-02    74
2013-07-03    78
2013-07-04    77
2013-07-05    76
2013-07-06    78
2013-07-07    72
Name: Mean TemperatureF, dtype: int64

In [64]:
# Relative temperature range - example (does not work well - column labels does not match)
week1_range / week1_mean

C:\Users\girtfolk\AppData\Local\Continuum\anaconda3\lib\site-packages\pandas\core\indexes\base.py:3033: RuntimeWarning: Cannot compare type 'Timestamp' with type 'str', sort order is undefined for incomparable objects
  return this.join(other, how=how, return_indexers=return_indexers)

,2013-07-01 00:00:00,2013-07-02 00:00:00,2013-07-03 00:00:00,2013-07-04 00:00:00,2013-07-05 00:00:00,2013-07-06 00:00:00,2013-07-07 00:00:00,Min TemperatureF,Max TemperatureF
Date,,,,,,,,,
2013-07-01,nan,nan,nan,nan,nan,nan,nan,nan,nan
2013-07-02,nan,nan,nan,nan,nan,nan,nan,nan,nan
2013-07-03,nan,nan,nan,nan,nan,nan,nan,nan,nan
2013-07-04,nan,nan,nan,nan,nan,nan,nan,nan,nan
2013-07-05,nan,nan,nan,nan,nan,nan,nan,nan,nan
2013-07-06,nan,nan,nan,nan,nan,nan,nan,nan,nan
2013-07-07,nan,nan,nan,nan,nan,nan,nan,nan,nan

In [65]:
# Relative temperature range - using .divide()
week1_range.divide(week1_mean, axis='rows')

            Min TemperatureF  Max TemperatureF
Date
2013-07-01             0.917             1.097
2013-07-02             0.892             1.135
2013-07-03             0.910             1.103
2013-07-04             0.909             1.117
2013-07-05             0.908             1.132
2013-07-06             0.897             1.141
2013-07-07             0.972             1.069

In [66]:
week1_mean.pct_change() * 100

Date
2013-07-01      nan
2013-07-02    2.778
2013-07-03    5.405
2013-07-04   -1.282
2013-07-05   -1.299
2013-07-06    2.632
2013-07-07   -7.692
Name: Mean TemperatureF, dtype: float64

In [70]:
# Load data
bronze = pd.read_csv('bronze_top5.csv', index_col=0)
bronze

silver = pd.read_csv('silver_top5.csv', index_col=0)
silver

gold = pd.read_csv('gold_top5.csv', index_col=0)
gold

                  Total
Country
United States  1052.000
Soviet Union    584.000
United Kingdom  505.000
France          475.000
Germany         454.000

                  Total
Country
United States  1195.000
Soviet Union    627.000
United Kingdom  591.000
France          461.000
Italy           394.000

                  Total
Country
United States  2088.000
Soviet Union    838.000
United Kingdom  498.000
Italy           460.000
Germany         407.000

In [72]:
# Add bronze, silver
bronze + silver # Germany - not in silver, Italy not in bronze -> result is Nan + int = Nan!!!!

                  Total
Country
France          936.000
Germany             nan
Italy               nan
Soviet Union   1211.000
United Kingdom 1096.000
United States  2247.000

In [74]:
# Using the .add() method
bronze.add(silver)

# Specifying fill_value (default is Nan)
bronze.add(silver, fill_value = 0)

                  Total
Country
France          936.000
Germany             nan
Italy               nan
Soviet Union   1211.000
United Kingdom 1096.000
United States  2247.000

                  Total
Country
France          936.000
Germany         454.000
Italy           394.000
Soviet Union   1211.000
United Kingdom 1096.000
United States  2247.000

In [77]:
# Adding bronze, silver, gold
bronze + silver + gold

bronze.add(silver, fill_value=0).add(gold, fill_value=0)

                  Total
Country
France              nan
Germany             nan
Italy               nan
Soviet Union   2049.000
United Kingdom 1594.000
United States  4335.000

                  Total
Country
France          936.000
Germany         861.000
Italy           854.000
Soviet Union   2049.000
United Kingdom 1594.000
United States  4335.000

### Broadcasting in arithmetic formulas

In [78]:
# ADDITIONAL
# Loading weather data
weather = pd.read_csv('pittsburgh2013.csv', index_col='Date', parse_dates=True)

,Max TemperatureF,Mean TemperatureF,Min TemperatureF,Max Dew PointF,MeanDew PointF,Min DewpointF,Max Humidity,Mean Humidity,Min Humidity,Max Sea Level PressureIn,...,Max VisibilityMiles,Mean VisibilityMiles,Min VisibilityMiles,Max Wind SpeedMPH,Mean Wind SpeedMPH,Max Gust SpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
Date,,,,,,,,,,,,,,,,,,,,,
2013-01-01,32,28,21,30,27,16,100,89,77,30.100,...,10,6,2,10,8,nan,0.000,8,Snow,277
2013-01-02,25,21,17,14,12,10,77,67,55,30.270,...,10,10,10,14,5,nan,0.000,4,NaN,272
2013-01-03,32,24,16,19,15,9,77,67,56,30.250,...,10,10,10,17,8,26.000,0.000,3,NaN,229
2013-01-04,30,28,27,21,19,17,75,68,59,30.280,...,10,10,6,23,16,32.000,0.000,4,NaN,250
2013-01-05,34,30,25,23,20,16,75,68,61,30.420,...,10,10,10,16,10,23.000,0.210,5,NaN,221

In [79]:
# Extract selected columns from weather as new DataFrame: temps_f
temps_f = weather[['Min TemperatureF', 'Mean TemperatureF', 'Max TemperatureF']]
# Convert temps_f to celsius: temps_c
temps_c = (temps_f - 32) * 5/9
# Rename 'F' in column names with 'C': temps_c.columns
temps_c.columns = temps_c.columns.str.replace('F', 'C')

# Print first 5 rows of temps_c
print(temps_c.head())

            Min TemperatureC  Mean TemperatureC  Max TemperatureC
Date
2013-01-01            -6.111             -2.222             0.000
2013-01-02            -8.333             -6.111            -3.889
2013-01-03            -8.889             -4.444             0.000
2013-01-04            -2.778             -2.222            -1.111
2013-01-05            -3.889             -1.111             1.111

### Computing percentage growth of GDP

In [82]:
# Changed from GDP.csv to gdp_usa.csv

# Read 'GDP.csv' into a DataFrame: gdp
gdp = pd.read_csv('gdp_usa.csv', index_col='DATE', parse_dates=True)
# Slice all the gdp data from 2008 onward: post2008
post2008 = gdp.loc['2008':, ]
# Print the last 8 rows of post2008
print(post2008.tail(8))

# Resample post2008 by year, keeping last(): yearly
yearly = post2008.resample('A').last()
    # need to chain .resample() (using the alias 'A' for annual frequency) with some kind of aggregation; 
    # you will use the aggregation method .last() to select the last element when resampling.
# Print yearly
print(yearly)

# Compute percentage growth of yearly: yearly['growth']
yearly['growth'] = yearly.pct_change() * 100
# Print yearly again
print(yearly)

               VALUE
DATE
2014-07-01 17569.400
2014-10-01 17692.200
2015-01-01 17783.600
2015-04-01 17998.300
2015-07-01 18141.900
2015-10-01 18222.800
2016-01-01 18281.600
2016-04-01 18436.500
               VALUE
DATE
2008-12-31 14549.900
2009-12-31 14566.500
2010-12-31 15230.200
2011-12-31 15785.300
2012-12-31 16297.300
2013-12-31 16999.900
2014-12-31 17692.200
2015-12-31 18222.800
2016-12-31 18436.500
               VALUE  growth
DATE
2008-12-31 14549.900     nan
2009-12-31 14566.500   0.114
2010-12-31 15230.200   4.556
2011-12-31 15785.300   3.645
2012-12-31 16297.300   3.244
2013-12-31 16999.900   4.311
2014-12-31 17692.200   4.072
2015-12-31 18222.800   2.999
2016-12-31 18436.500   1.173

### Converting currency of stocks

In [83]:
# Read 'sp500.csv' into a DataFrame: sp500
sp500 = pd.read_csv('sp500.csv', parse_dates=True, index_col='Date')
# Read 'exchange.csv' into a DataFrame: exchange
exchange = pd.read_csv('exchange.csv', parse_dates=True, index_col='Date')
# Subset 'Open' & 'Close' columns from sp500: dollars
dollars = sp500.loc[:, ['Open', 'Close']]
# Print the head of dollars
print(dollars.head())

# Convert dollars to pounds: pounds
pounds = dollars.multiply(exchange['GBP/USD'], axis='rows')
# Print the head of pounds
print(pounds.head())

               Open    Close
Date
2015-01-02 2058.900 2058.200
2015-01-05 2054.440 2020.580
2015-01-06 2022.150 2002.610
2015-01-07 2005.550 2025.900
2015-01-08 2030.610 2062.140
               Open    Close
Date
2015-01-02 1340.364 1339.909
2015-01-05 1348.617 1326.390
2015-01-06 1332.516 1319.640
2015-01-07 1330.562 1344.063
2015-01-08 1343.269 1364.126

# Concatenating data

## Appending & concatenating Series

### General - .append(), .concat()

In [ ]:
s1.append(s2)
    # accepts DF and Series
    # add rows at end of first object
    # can only append rows
pd.concat([s1, s2, s3])
    # can stack row-wise or column-wise
    
result1 = pd.concat([s1, s2, s3])
result2 = s1.append(s2).append(s3)
    # result1 == result2 elementwise

In [8]:
l1 = pd.Series(['a1', 'b1'])
l2 = pd.Series(['a2', 'b2'])
l3 = pd.Series(['a3', 'b3'])
l4 = pd.Series(['a4', 'b4'])

l12 = l1.append(l2)
print(l12)

0    a1
1    b1
0    a2
1    b2
dtype: object

In [11]:
# Index is kept from each object, as can be seen from above
print(l12.index)
print(l12.loc[1])

Int64Index([0, 1, 0, 1], dtype='int64')
1    b1
1    b2
dtype: object

In [12]:
l34 = l3.append(l4).reset_index(drop=True) 
    # drop=True -> used to drop column from what index was created, rather than keeping it as column in DataFrame
print(l34.index)

RangeIndex(start=0, stop=4, step=1)

In [14]:
l34 = pd.concat([l3, l4])
print(l34)

0    a3
1    b3
0    a4
1    b4
dtype: object

In [15]:
l34 = pd.concat([l3, l4], ignore_index=True)
    # ignore_index=True -> result will be same as if .reset_index() was used
print(l34)
print(l34.index)

0    a3
1    b3
2    a4
3    b4
dtype: object
RangeIndex(start=0, stop=4, step=1)

### Appending pandas Series

In [19]:
# Load 'sales-jan-2015.csv' into a DataFrame: jan
jan = pd.read_csv('sales-jan-2015.csv', parse_dates=True, index_col='Date')
# Load 'sales-feb-2015.csv' into a DataFrame: feb
feb = pd.read_csv('sales-feb-2015.csv', parse_dates=True, index_col='Date')
# Load 'sales-mar-2015.csv' into a DataFrame: mar
mar = pd.read_csv('sales-mar-2015.csv', parse_dates=True, index_col='Date')
# Extract the 'Units' column from jan: jan_units
jan_units = jan['Units']
# Extract the 'Units' column from feb: feb_units
feb_units = feb['Units']
# Extract the 'Units' column from mar: mar_units
mar_units = mar['Units']

# Append feb_units and then mar_units to jan_units: quarter1
quarter1 = jan_units.append(feb_units).append(mar_units)

# Print the first slice from quarter1
print(quarter1.loc['jan 27, 2015':'feb 2, 2015'])
# Print the second slice from quarter1
print(quarter1.loc['feb 26, 2015':'mar 7, 2015'])
# Compute & print total sales in quarter1
print(quarter1.sum())

pandas.core.series.Series

Date
2015-01-27 07:11:55    18
2015-02-02 08:33:01     3
2015-02-02 20:54:49     9
Name: Units, dtype: int64
Date
2015-02-26 08:57:45     4
2015-02-26 08:58:51     1
2015-03-06 10:11:45    17
2015-03-06 02:03:56    17
Name: Units, dtype: int64
642

### Concatenating pandas Series along row axis

In [ ]:
# Initialize empty list: units
units = []

# Build the list of Series
for month in [jan, feb, mar]:
    units.append(month['Units']) # jan -> df, and it has column 'Units'

# Concatenate the list: quarter1
quarter1 = pd.concat(units, axis='rows')

# Print slices from quarter1
print(quarter1.loc['jan 27, 2015':'feb 2, 2015'])
print(quarter1.loc['feb 26, 2015':'mar 7, 2015'])

## Appending & concatenating DataFrames

### General

In [24]:
# THERE WERE NO DATA SO USED OTHER!!!
df1 = pd.read_csv('sales-feb-2015.csv', index_col=0)
df2 = pd.read_csv('sales-jan-2015.csv', index_col=0)
df1.head()
df2.head()

                       Company   Product  Units
Date
2015-02-26 08:57:45  Streeplex   Service      4
2015-02-16 12:09:19      Hooli  Software     10
2015-02-03 14:14:18    Initech  Software     13
2015-02-02 08:33:01      Hooli  Software      3
2015-02-25 00:29:00    Initech   Service     10

                       Company   Product  Units
Date
2015-01-21 19:13:21  Streeplex  Hardware     11
2015-01-09 05:23:51  Streeplex   Service      8
2015-01-06 17:19:34    Initech  Hardware     17
2015-01-02 09:51:06      Hooli  Hardware     16
2015-01-11 14:51:02      Hooli  Hardware     11

In [27]:
df1.append(df2).head()
print(df1.index.name, df1.columns)
print(df2.index.name, df2.columns)

# same columns and index name gives same column count and just add rows!!!

                       Company   Product  Units
Date
2015-02-26 08:57:45  Streeplex   Service      4
2015-02-16 12:09:19      Hooli  Software     10
2015-02-03 14:14:18    Initech  Software     13
2015-02-02 08:33:01      Hooli  Software      3
2015-02-25 00:29:00    Initech   Service     10

Date Index(['Company', 'Product', 'Units'], dtype='object')
Date Index(['Company', 'Product', 'Units'], dtype='object')

In [28]:
# THERE WERE NO DATA SO USED OTHER!!!
df1 = pd.read_csv('sales-feb-2015.csv', index_col=0)
df2 = pd.read_csv('silver.csv', index_col=0)
df1.head()
df2.head()

                       Company   Product  Units
Date
2015-02-26 08:57:45  Streeplex   Service      4
2015-02-16 12:09:19      Hooli  Software     10
2015-02-03 14:14:18    Initech  Software     13
2015-02-02 08:33:01      Hooli  Software      3
2015-02-25 00:29:00    Initech   Service     10

            Country    Total
NOC
USA   United States 1195.000
URS    Soviet Union  627.000
GBR  United Kingdom  591.000
FRA          France  461.000
GER         Germany  350.000

In [39]:
print(df1.append(df2).head(), df1.append(df2).tail())
    # columns sorted alphabetically, if there is no value in any of df then Nan

                       Company Country   Product  Total  Units
2015-02-26 08:57:45  Streeplex     NaN   Service    nan  4.000
2015-02-16 12:09:19      Hooli     NaN  Software    nan 10.000
2015-02-03 14:14:18    Initech     NaN  Software    nan 13.000
2015-02-02 08:33:01      Hooli     NaN  Software    nan  3.000
2015-02-25 00:29:00    Initech     NaN   Service    nan 10.000     Company               Country Product  Total  Units
SEN     NaN               Senegal     NaN  1.000    nan
SUD     NaN                 Sudan     NaN  1.000    nan
TGA     NaN                 Tonga     NaN  1.000    nan
BDI     NaN               Burundi     NaN    nan    nan
UAE     NaN  United Arab Emirates     NaN    nan    nan

In [41]:
pd.concat([df1, df2], axis=0).head()
pd.concat([df1, df2], axis=0).tail()
    # axis=0 -> stacking rows verticaly

                       Company Country   Product  Total  Units
2015-02-26 08:57:45  Streeplex     NaN   Service    nan  4.000
2015-02-16 12:09:19      Hooli     NaN  Software    nan 10.000
2015-02-03 14:14:18    Initech     NaN  Software    nan 13.000
2015-02-02 08:33:01      Hooli     NaN  Software    nan  3.000
2015-02-25 00:29:00    Initech     NaN   Service    nan 10.000

    Company               Country Product  Total  Units
SEN     NaN               Senegal     NaN  1.000    nan
SUD     NaN                 Sudan     NaN  1.000    nan
TGA     NaN                 Tonga     NaN  1.000    nan
BDI     NaN               Burundi     NaN    nan    nan
UAE     NaN  United Arab Emirates     NaN    nan    nan

In [42]:
pd.concat([df1, df2], axis=1).head()
pd.concat([df1, df2], axis=1).tail()
    # main difference is that if there is index value that is present in both df then result is INNER JOIN of those columns

                             Company   Product  Units Country  Total
2015-02-02 08:33:01            Hooli  Software  3.000     NaN    nan
2015-02-02 20:54:49        Mediacore  Hardware  9.000     NaN    nan
2015-02-03 14:14:18          Initech  Software 13.000     NaN    nan
2015-02-04 15:36:29        Streeplex  Software 13.000     NaN    nan
2015-02-04 21:52:45  Acme Coporation  Hardware 14.000     NaN    nan

    Company Product  Units      Country   Total
VIE     NaN     NaN    nan      Vietnam   2.000
YUG     NaN     NaN    nan   Yugoslavia 174.000
ZAM     NaN     NaN    nan       Zambia   1.000
ZIM     NaN     NaN    nan     Zimbabwe   4.000
ZZX     NaN     NaN    nan  Mixed teams  15.000

### Appending DataFrames with ignore_index

In [48]:
names_1881 = pd.read_csv('names1881.csv', names=['name', 'gender', 'count'])
names_1981 = pd.read_csv('names1981.csv', names=['name', 'gender', 'count'])

In [49]:
# Add 'year' column to names_1881 and names_1981
names_1881['year'] = 1881
names_1981['year'] = 1981

# Append names_1981 after names_1881 with ignore_index=True: combined_names
combined_names = names_1881.append(names_1981, ignore_index=True)

# Print shapes of names_1981, names_1881, and combined_names
print(names_1981.shape)
print(names_1881.shape)
print(combined_names.shape)

# Print all rows that contain the name 'Morgan'
print(combined_names.loc[combined_names['name']=='Morgan'])

       name gender  count
0  Jennifer      F  57032
1   Jessica      F  42519
2    Amanda      F  34370
3     Sarah      F  28162
4   Melissa      F  28003

### Concatenating pandas DataFrames along column axis

### Reading multiple files to build a DataFrame

## Concatenation, keys, & MultiIndexes

### General

### Concatenating vertically to get MultiIndexed columns

### Slicing MultiIndexed DataFrames

### Concatenating horizontally to get MultiIndexed columns

### Concatenating DataFrames from a dict

## Outer & inner joins

### General

### Concatenating DataFrames with inner join

### Resampling & concatenating DataFrames with inner join

# Merging data

# Case study - Summer Olympics